# دیکشنری کد مورس
morseDictionary  = {
    'A': '.-', 'B': '-...', 'C': '-.-.', 'D': '-..', 'E': '.', 
    'F': '..-.', 'G': '--.', 'H': '....', 'I': '..', 'J': '.---',
    'K': '-.-', 'L': '.-..', 'M': '--', 'N': '-.', 'O': '---', 
    'P': '.--.', 'Q': '--.-', 'R': '.-.', 'S': '...', 'T': '-', 
    'U': '..-', 'V': '...-', 'W': '.--', 'X': '-..-', 'Y': '-.--', 
    'Z': '--..', '1': '.----', '2': '..---', '3': '...--', 
    '4': '....-', '5': '.....', '6': '-....', '7': '--...', 
    '8': '---..', '9': '----.', '0': '-----', ',': '--..--', 
    '.': '.-.-.-', '?': '..--..', "'": '.----.', '!': '-.-.--', 
    '/': '-..-.', '(': '-.--.', ')': '-.--.-', '&': '.-...', 
    ':': '---...', ';': '-.-.-.', '=': '-...-', '+': '.-.-.', 
    '-': '-....-', '_': '..--.-', '"': '.-..-.', '$': '...-..-', 
    '@': '.--.-.', ' ': '/'
}
# تابع تبدیل متن به کد مورس

def textMorse(text):
    text = text.upper()
    morse_code = []
    for char in text:
        if char in morseDictionary :
            morse_code.append(morseDictionary [char])
    return ' '.join(morse_code)

input_text = input("لطفاً متن خود را وارد کنید: ")
morse_output = textMorse(input_text)

print(f"کد مورس متن شما: {morse_output}")
